---
kind: method
id: M:Autodesk.Revit.DB.PDFExportOptions.Dispose
source: html/db86e000-b370-db8a-4fa8-35304e25b3b7.htm
---
# Autodesk.Revit.DB.PDFExportOptions.Dispose Method

Releases all resources used by the PDFExportOptions

## Syntax (C#)
```csharp
public void Dispose()
```